In [1]:
import pandas as pd

In [2]:
# Load the CSV data
file_path = 'sample_data.txt'
df = pd.read_csv(file_path)
df

    Name  Age      City  Temp
0  Alice   30    Austin  90.2
1    Bob   25    Dallas  91.9
2  Carol   35   Houston  93.5
3  David   40  San Jose  75.0
4    Eve   28    Austin  90.2

In [3]:
for index, row in df.iterrows():
    print(f"{index}\t\n{row}")
    break

0
Name     Alice
Age         30
City    Austin
Temp      90.2
Name: 0, dtype: object

In [4]:
for index, row in df.iterrows():
    where_clause = 'WHERE '
    conditions = []
    for column, value in row.items():
        if isinstance(value, str):
            condition = f"{column} = '{value}'"
        else:
            condition = f"{column} = {value}"
        conditions.append(condition)
    where_clause += " AND ".join(conditions)
    print(f"Row {index + 1} WHERE clause: {where_clause}")

Row 1 WHERE clause: WHERE Name = 'Alice' AND Age = 30 AND City = 'Austin' AND Temp = 90.2
Row 2 WHERE clause: WHERE Name = 'Bob' AND Age = 25 AND City = 'Dallas' AND Temp = 91.9
Row 3 WHERE clause: WHERE Name = 'Carol' AND Age = 35 AND City = 'Houston' AND Temp = 93.5
Row 4 WHERE clause: WHERE Name = 'David' AND Age = 40 AND City = 'San Jose' AND Temp = 75.0
Row 5 WHERE clause: WHERE Name = 'Eve' AND Age = 28 AND City = 'Austin' AND Temp = 90.2

In [5]:
def generate_where_clause(row) -> str:
    where_clause = 'WHERE '
    conditions = []
    for column, value in row.items():
        if isinstance(value, str):
            condition = f"{column} = '{value}'"
        else:
            condition = f"{column} = {value}"
        conditions.append(condition)
    where_clause += " AND ".join(conditions)
    return where_clause

# Iterate over each row and generate the WHERE clause
for _, row in df.iterrows():
    where_clause = generate_where_clause(row)
    print(f"{where_clause}")

WHERE Name = 'Alice' AND Age = 30 AND City = 'Austin' AND Temp = 90.2
WHERE Name = 'Bob' AND Age = 25 AND City = 'Dallas' AND Temp = 91.9
WHERE Name = 'Carol' AND Age = 35 AND City = 'Houston' AND Temp = 93.5
WHERE Name = 'David' AND Age = 40 AND City = 'San Jose' AND Temp = 75.0
WHERE Name = 'Eve' AND Age = 28 AND City = 'Austin' AND Temp = 90.2